[
  {
    "talk_startseite": 1,
    "talk_date": "2024-11-18",
    "talk_title": "Web Audio & openDAW",
    "talk_image": "",
    "talk_description": "André gibt einen Überblick über die Entwicklung von Web Audio, von Flashplayer bis zur Web Audio API. Während man sich früher den Main-Thread teilen musste, ermöglichen heute AudioWorklet und WebAssembly komplexes Echtzeit-AudioProcessing im Web. André zeigt einige kurzweilige Experimente und stellt das zukünftige open-source Projekt openDAW vor, eine Plattform, die Musikproduktion im Web demokratisieren soll, mit Fokus auf Accessibility und Education für alle, die Musik produzieren oder lernen wollen. <a href='https://openDAW.org'>https://openDAW.org</a>",
    "talk_speaker": "André Michelle (Kickstarter openDAW)",
    "talk_speakerhandle_mastodon": "",
    "talk_speakerhandle_mastodon_link": "",
    "talk_speakerhandle_linkedin": "https://www.linkedin.com/in/andremichelle/",
    "talk_slideslink": ""
  },
  {
    "talk_startseite": 1,
    "talk_date": "2024-11-18",
    "talk_title": "Blender",
    "talk_image": "",
    "talk_description": "Benjamin stellt die vielseitige 3D-Software Blender vor, welche sich durch ihre Open-Source-Natur und steht’s wachsende Beliebtheit auszeichnet. Wir werfen einen kurzer Blick auf die Entstehung, Historie und zeigen was Blender von anderer 3D Software abgrenzt. Benjamin gibt Überblick zum Potenzial unterschiedlicher Spezialisierung/Anwendung und stellt Besonderheiten wie „Geometry Nodes“ und „Grease Pencil“ vor.",
    "talk_speaker": "Benjamin Helsper (Motion Designer)",
    "talk_speakerhandle_mastodon": "",
    "talk_speakerhandle_mastodon_link": "",
    "talk_speakerhandle_linkedin": "https://www.linkedin.com/in/benjamin-helsper-bb621460/",
    "talk_slideslink": ""
  },
  {
    "talk_startseite": "",
    "talk_date": "2024-05-13",
    "talk_title": "DOM Event Cancellation - pitfalls and solutions",
    "talk_image": "",
    "talk_description": "We use event cancellation whenever we need finer control over which event listeners in the DOM should run and which shouldn't. If we are unaware of the pitfalls we can cause hard-to-detect bugs that might easily slip through testing and end up in production. Let's uncover those pitfalls and explore solutions.",
    "talk_speaker": "Martin Winkler, Web-Entwickler bei Avenga Germany GmbH",
    "talk_speakerhandle_mastodon": "@mwinkler@mastodon.social",
    "talk_speakerhandle_mastodon_link": "https://mastodon.social/@mwinkler",
    "talk_speakerhandle_linkedin": "",
    "talk_slideslink": "https://github.com/teetotum/material/tree/master/dom-event-cancellation-revised"
  },
  {
    "talk_startseite": "",
    "talk_date": "2024-05-13",
    "talk_title": "Rust, Typescript, C++, Javascript – Die Unterschiede für Nicht-Informatiker",
    "talk_image": "",
    "talk_description": "Begriffe wie Compiler, Transpiler, Interpreter aber auch Pointer oder BufferOverwflow oder Call-Stack klingen für Außenstehende aber auch für den/die fähige/n Programmierer:in, Quereinsteiger:in, Anfänger:in oft genung nach böhmischen Dörfern. <br>Mein Ziel ist es, diese Dinge unkompliziert und verständlich darzustellen – Damit möchte ich euch die Mittel an die Hand geben, um auch technische Fachartikel im Bereich der Programmiersprachen einfach und nachvollziehbar zu machen.",
    "talk_speaker": "Sascha Duepre",
    "talk_speakerhandle_mastodon": "",
    "talk_speakerhandle_linkedin": "https://www.linkedin.com/in/sascha-duepre/",
    "talk_speakerhandle_mastodon_link": "",
    "talk_slideslink": ""
  },
  {
    "talk_startseite": "",
    "talk_date": "2024-03-18",
    "talk_title": "Open-Source Science (OSSci): Wissenschaftliche Forschung beschleunigen durch Stärkung von Open Source",
    "talk_image": "",
    "talk_description": "Open-Source Science (OSSci) ist eine Initiative von NumFOCUS – gegründet im Juli 2022 in Partnership mit IBM – mit dem Ziel, wissenschaftliche Forschung dadurch zu beschleunigen, indem man den Einsatz von Open-Source Software und jegliche damit zusammenhängenden Prozesse und Strukturen verbessert. OSSci vernetzt Wissenschaftler/innen, Open-Source-Entwickler/innen und andere Stakeholder/innen, um Best Practices auszutauschen, typische Reibungspunkte zu identifizieren und gemeinsam Lösungen zu entwickeln. Unsere bisherigen Arbeitsgruppen behandeln die Themenschwerpunkte Chemie/Materialwissenschaften, Life Sciences und Klima/Sustainability.",
    "talk_speaker": "Tim Bonnemann",
    "talk_speakerhandle_mastodon": "@sfba.social/@planspark",
    "talk_speakerhandle_mastodon_link": "https://sfba.social/@planspark",
    "talk_speakerhandle_linkedin": "https://www.linkedin.com/in/tbonnemann/",
    "talk_slideslink": "https://opensource.science/how-to-get-involved-in-ossci-be4f9d0b2c3d"
  },
  {
    "talk_startseite": "",
    "talk_date": "2024-03-18",
    "talk_title": "Microservices. Why? – Or why not?",
    "talk_image": "",
    "talk_description": "Microservices sind seit einigen Jahren bereits Thema. Das narrativ und die Haltung dazu hat sich im Hinblick der vergangenen Jahren geändert und der Hype ist abgeflacht. Zurecht? Dieser Vortrag zeigt einige Faktoren und Punkte auf unter denen man erwägen sollte, ob der Einsatz von Microservices probat ist oder eben nicht — durch die Sicht als Projektmanager wird hier ein Einblick gegeben. <br>Optional folgt in einem zweiten Teil ein technischer Part, der durch den Blick als DevOp auf das Thema weitere Faktoren, die bei der Entscheidungsfindung helfen, darlegt.",
    "talk_speaker": "Sascha Duepre",
    "talk_speakerhandle_mastodon": "",
    "talk_speakerhandle_linkedin": "https://www.linkedin.com/in/sascha-duepre/",
    "talk_speakerhandle_mastodon_link": "",
    "talk_slideslink": "/files/pdfs/2024-03-18_Webmontag-Bonn_Microservices - Why.pptx"
  },
  {
    "talk_date": "2024-02-19",
    "talk_title": "Film Screening mit anschließender Diskussion: 'Ex Machina'",
    "talk_image": "ex-machina_text.webp",
    "talk_description": "Der Webmontag Bonn lädt einem besonderen Filmabend innerhalb der Kinodedition-Reihe ein: <br><br> Mit „Ex Machina”, Ein junger, sensibler Programmierer namens Caleb arbeitet für Blue Book, die führende Suchmaschine der Welt. Er erhält die Chance, eine Woche mit dem rätselhaften CEO des Unternehmens, Nathan, zu verbringen. Was als einzigartige Gelegenheit beginnt, entpuppt sich bald als eine Reise in die Tiefen der menschlichen Psyche und der Möglichkeiten künstlicher Intelligenz. In diesem stilvollen, psychologischen Thriller, der in der abgeschiedenen Schönheit Norwegens gedreht wurde, begegnet Caleb der humanoiden Ava. Ava ist ein faszinierendes Wesen, halb Mensch, halb Maschine, das Caleb in seinen Bann zieht. Ihre Erscheinung, eine Mischung aus synthetischer Haut, Kunststoff und transparentem Gehäuse, offenbart die meisterhafte Verschmelzung bionischer und Machine Learning Technologien. <br><br> „Ex Machina” ist ein herausforderndes, philosophisches Drama, das mit feinen Schauspielleistungen, cleveren Wendungen und fundierten wissenschaftlichen Dialog überrascht. Doch unter der glänzenden Oberfläche verbirgt sich etwas, das sowohl intelligent als auch so gewagt ist, so dass es uns einlädt, die Mechanismen hinter der schicken Fassade zu erkunden und unsere persönliche Position in einem Mensch-Maschine-Kontinuum zu finden, indem die Grenzen zunehmend verschwimmen. <br><br>Nach dem Film erwartet Euch eine angeregte Diskussionsrunde, in der wir gemeinsam die Themen des Films erkunden. Wir freuen uns auf einen Abend voller intellektueller Anregungen und tiefgreifender Gespräche.<br><br> Location:<br>Bonner Kinemathek(Brotfabrik) • Kreuzstraße 16 • Bonn<br>    Beginn: 19:30 Uhr, Einlass kurz vorher & freie Platzwahl<br>    Sprache: englisch (OmU)<br>    Eintritt: € 9 ermäßigt: € 7",
    "talk_speaker": "Moderation: Damian Paderta",
    "talk_speakerhandle": "paderta",
    "talk_slideslink": ""
  },
  {
   
    "talk_date": "2024-01-15",
    "talk_title": "Green Software Basics",
    "talk_description": "Nachhaltigkeit spielt heute eine entscheidende Rolle. Welche Möglichkeiten haben Softwareentwickler, um einen positiven Beitrag zum Umweltschutz zu leisten? Dieser Frage ist Andreas nachgegangen und stellt seine Erfahrungen, mögliche Ansätze und ein paar praktische Beispiele vor. Der Vortrag versteht sich als einfacher Einstieg in das komplexe wie zukunftsweisende Thema 'nachhaltige Softwareentwicklung'.",
    "talk_speaker": "Andreas Gartz",
    "talk_speakerhandle_mastodon": "",
    "talk_speakerhandle_mastodon_link": "",
    "talk_slideslink": ""
  },
  {
   
    "talk_date": "2024-01-15",
    "talk_title": "Dynamische Formulare mit JSON und AJV",
    "talk_description": "Der Vortrag zeigt anhand konkreter Fallbeispiele, wie mit JSON-Schema Formularfelder definiert und mit AJV validiert werden können. Darüber hinaus werden Erfahrungen und Best-Practices aus dem Praxiseinsatz vermittelt.",
    "talk_speaker": "Christian Klihm",
    "talk_speakerhandle_mastodon": "",
    "talk_speakerhandle_mastodon_link": "",
    "talk_slideslink": ""
  }
]